[NoCoverage] BlockStatement
courses/minesweeper/src/App.tsx:8:19
 
 const AppContainer = tw.div`grid gap-y-4 justify-center min-w-full max-w-sm pt-8`
 
-const App = () => {
-  return (
-    <AppContainer>
-      <Header
-        text="minesweeper"
-        feature="flag"
-        firstAction="alt"
-        secondAction="click"
-      />
-      <Hud time={'000'} levels={['beginner', 'intermediate', 'expert']} mines={'010'} onReset={() => console.log('reset!')}/>
-    </AppContainer>
-  )
-}
+const App = () => {}
 
 export default App

[NoCoverage] ArrowFunction
courses/minesweeper/src/App.tsx:17:96
         firstAction="alt"
         secondAction="click"
       />
-      <Hud time={'000'} levels={['beginner', 'intermediate', 'expert']} mines={'010'} onReset={() => console.log('reset!')}/>
+      <Hud time={'000'} levels={['beginner', 'intermediate', 'expert']} mines={'010'} onReset={() => undefined}/>
     </AppContainer>
   )

[NoCoverage] StringLiteral
courses/minesweeper/src/App.tsx:17:46
         firstAction="alt"
         secondAction="click"
       />
-      <Hud time={'000'} levels={['beginner', 'intermediate', 'expert']} mines={'010'} onReset={() => console.log('reset!')}/>
+      <Hud time={'000'} levels={['beginner', "", 'expert']} mines={'010'} onReset={() => console.log('reset!')}/>
     </AppContainer>
   )
