[Survived] StringLiteral
src/components/Grid/Cell.tsx:10:6
 const transparent = 'rgba(0,0,0.0)'
 const colors: { [key in CellType ]: string} = {
   0: '#0f172a',
-  1: '#bae6fd',
+  1: "",
   2: '#99f6e4',
   3: '#a78bfa',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:11:6
 const colors: { [key in CellType ]: string} = {
   0: '#0f172a',
   1: '#bae6fd',
-  2: '#99f6e4',
+  2: "",
   3: '#a78bfa',
   4: '#f0abfc',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:15:6
   3: '#a78bfa',
   4: '#f0abfc',
   5: '#bef264',
-  6: '#fb923c',
+  6: "",
   7: '#fbbf24',
   8: '#fda4af',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:17:6
   5: '#bef264',
   6: '#fb923c',
   7: '#fbbf24',
-  8: '#fda4af',
+  8: "",
   9: 'transparent',
   10: 'transparent',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:18:6
   6: '#fb923c',
   7: '#fbbf24',
   8: '#fda4af',
-  9: 'transparent',
+  9: "",
   10: 'transparent',
   11: 'transparent',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:19:7
   7: '#fbbf24',
   8: '#fda4af',
   9: 'transparent',
-  10: 'transparent',
+  10: "",
   11: 'transparent',
   12: 'transparent',

[Killed] StringLiteral
src/components/Grid/Cell.tsx:40:58
 
 type HiddenCellProps = Pick<CellProps, 'mouseDown'>
 
-const HiddenCell = styled(CellContainer)<HiddenCellProps>`
-  ${tw`select-none hover:bg-slate-600 transition-all duration-300`}
-  box-shadow: -3px 3px rgba(0, 0, 0, 0.7), -2px 2px rgba(0, 0, 0, 0.7), -1px 1px rgba(0, 0, 0, 0.7);
-  border: 1px solid ${({mouseDown = false}) => mouseDown ? 'transparent' : 'rgba(0,0,0,0.8)'};
-
-  &:active {
-    box-shadow: -1px 1px rgba(0, 0, 0, 0.7), -2px 2px rgba(0, 0, 0, 0.7), -1px 1px rgba(0, 0, 0, 0.7);
-  }
-`
+const HiddenCell = styled(CellContainer)<HiddenCellProps>``
 
 
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell Component onClick and onContextMenu handlers called for active cells 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:41:7
 type HiddenCellProps = Pick<CellProps, 'mouseDown'>
 
 const HiddenCell = styled(CellContainer)<HiddenCellProps>`
-  ${tw`select-none hover:bg-slate-600 transition-all duration-300`}
+  ${tw``}
   box-shadow: -3px 3px rgba(0, 0, 0, 0.7), -2px 2px rgba(0, 0, 0, 0.7), -1px 1px rgba(0, 0, 0, 0.7);
   border: 1px solid ${({mouseDown = false}) => mouseDown ? 'transparent' : 'rgba(0,0,0,0.8)'};
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell Component onClick and onContextMenu handlers called for active cells 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:43:23
 const HiddenCell = styled(CellContainer)<HiddenCellProps>`
   ${tw`select-none hover:bg-slate-600 transition-all duration-300`}
   box-shadow: -3px 3px rgba(0, 0, 0, 0.7), -2px 2px rgba(0, 0, 0, 0.7), -1px 1px rgba(0, 0, 0, 0.7);
-  border: 1px solid ${({mouseDown = false}) => mouseDown ? 'transparent' : 'rgba(0,0,0,0.8)'};
+  border: 1px solid ${() => undefined};
 
   &:active {
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell Component onClick and onContextMenu handlers called for active cells 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[NoCoverage] BooleanLiteral
src/components/Grid/Cell.tsx:43:37
 const HiddenCell = styled(CellContainer)<HiddenCellProps>`
   ${tw`select-none hover:bg-slate-600 transition-all duration-300`}
   box-shadow: -3px 3px rgba(0, 0, 0, 0.7), -2px 2px rgba(0, 0, 0, 0.7), -1px 1px rgba(0, 0, 0, 0.7);
-  border: 1px solid ${({mouseDown = false}) => mouseDown ? 'transparent' : 'rgba(0,0,0,0.8)'};
+  border: 1px solid ${({mouseDown = true}) => mouseDown ? 'transparent' : 'rgba(0,0,0,0.8)'};
 
   &:active {

[Survived] ArrowFunction
src/components/Grid/Cell.tsx:53:12
 
 const OpenCell = styled(CellContainer)<Pick<CellProps, 'type'>>`
   ${tw`cursor-default border-slate-500`}
-  color: ${({ type }) => colors[type as CellType] ?? transparent};
+  color: ${() => undefined};
 `
 

[Survived] LogicalOperator
src/components/Grid/Cell.tsx:53:26
 
 const OpenCell = styled(CellContainer)<Pick<CellProps, 'type'>>`
   ${tw`cursor-default border-slate-500`}
-  color: ${({ type }) => colors[type as CellType] ?? transparent};
+  color: ${({ type }) => colors[(type as CellType)] && transparent};
 `
 

[Survived] StringLiteral
src/components/Grid/Cell.tsx:63:32
   border-bottom: .5rem solid transparent;
 `
 
-const Flag = styled(StyledFlag)`
-  border-left: .5rem solid #ec433c;
-`
+const Flag = styled(StyledFlag)``
 
 const WeakFlag = styled(StyledFlag)`

[Survived] StringLiteral
src/components/Grid/Cell.tsx:67:36
   border-left: .5rem solid #ec433c;
 `
 
-const WeakFlag = styled(StyledFlag)`
-  border-left: .5rem solid #fcd34d
-`
+const WeakFlag = styled(StyledFlag)``
 
 const Bomb = tw.div`

[Survived] StringLiteral
src/components/Grid/Cell.tsx:71:20
   border-left: .5rem solid #fcd34d
 `
 
-const Bomb = tw.div`
-  rounded-full w-4 h-4 bg-slate-900
-`
+const Bomb = tw.div``
 
 const BombFrame = tw(OpenCell)`bg-rose-600`

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:81:25
   const [mouseDown, onMouseUp, onMouseDown] = useMouseDown()
   const isActiveCell = isActive(type)
 
-  const onClick = () => rest.onClick && rest.onClick(coords)
+  const onClick = () => false
 
   const onContextMenu = (el: React.MouseEvent<HTMLElement>) => {
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/components/Grid/Cell.tsx:81:25
   const [mouseDown, onMouseUp, onMouseDown] = useMouseDown()
   const isActiveCell = isActive(type)
 
-  const onClick = () => rest.onClick && rest.onClick(coords)
+  const onClick = () => rest.onClick || rest.onClick(coords)
 
   const onContextMenu = (el: React.MouseEvent<HTMLElement>) => {
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Grid/Cell.tsx:83:64
 
   const onClick = () => rest.onClick && rest.onClick(coords)
 
-  const onContextMenu = (el: React.MouseEvent<HTMLElement>) => {
-    el.preventDefault()
-    if (isActiveCell) rest.onContextMenu(coords)
-  }
+  const onContextMenu = (el: React.MouseEvent<HTMLElement>) => {}
 
   const activeProps = {
killedBy: Cell Component check prevent default for context menu
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:85:9
 
   const onContextMenu = (el: React.MouseEvent<HTMLElement>) => {
     el.preventDefault()
-    if (isActiveCell) rest.onContextMenu(coords)
+    if (false) rest.onContextMenu(coords)
   }
 
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/components/Grid/Cell.tsx:85:9
 
   const onContextMenu = (el: React.MouseEvent<HTMLElement>) => {
     el.preventDefault()
-    if (isActiveCell) rest.onContextMenu(coords)
+    if (true) rest.onContextMenu(coords)
   }
 

[Killed] ObjectLiteral
src/components/Grid/Cell.tsx:88:23
     if (isActiveCell) rest.onContextMenu(coords)
   }
 
-  const activeProps = {
-    className: `cell-${coords.join('-')}`,
-    mouseDown,
-    onClick,
-    onContextMenu,
-    onMouseUp,
-    onMouseDown,
-    type,
-  }
+  const activeProps = {}
 
   const inactiveProps = {
killedBy: Cell Component check prevent default for context menu
statusReason: Error: Unable to fire a "contextmenu" event - please provide a DOM element.

[Killed] StringLiteral
src/components/Grid/Cell.tsx:89:36
   }
 
   const activeProps = {
-    className: `cell-${coords.join('-')}`,
+    className: `cell-${coords.join("")}`,
     mouseDown,
     onClick,
killedBy: Cell Component check prevent default for context menu
statusReason: Error: Unable to fire a "contextmenu" event - please provide a DOM element.

[Survived] ConditionalExpression
src/components/Grid/Cell.tsx:105:5
   }
 
   switch (type) {
-    case CellState.empty:
-      return <OpenCell {...inactiveProps}/>
+    case CellState.empty:
     case CellState.bomb:
       return <BombFrame {...inactiveProps}>

[Survived] ConditionalExpression
src/components/Grid/Cell.tsx:107:5
   switch (type) {
     case CellState.empty:
       return <OpenCell {...inactiveProps}/>
-    case CellState.bomb:
-      return <BombFrame {...inactiveProps}>
-        <Bomb/>
-      </BombFrame>
+    case CellState.bomb:
     case CellState.hidden:
       return <HiddenCell {...activeProps}/>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:111:5
       return <BombFrame {...inactiveProps}>
         <Bomb/>
       </BombFrame>
-    case CellState.hidden:
-      return <HiddenCell {...activeProps}/>
+    case CellState.hidden:
     case CellState.flag:
       return <HiddenCell {...activeProps}>
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell Component onClick and onContextMenu handlers called for active cells 1`

- Snapshot  - 0
+ Received  + 4

  <DocumentFragment>

[Survived] ConditionalExpression
src/components/Grid/Cell.tsx:113:5
       </BombFrame>
     case CellState.hidden:
       return <HiddenCell {...activeProps}/>
-    case CellState.flag:
-      return <HiddenCell {...activeProps}>
-        <Flag/>
-      </HiddenCell>
+    case CellState.flag:
     case CellState.weakFlag:
       return <HiddenCell {...activeProps}>

[Survived] ConditionalExpression
src/components/Grid/Cell.tsx:117:5
       return <HiddenCell {...activeProps}>
         <Flag/>
       </HiddenCell>
-    case CellState.weakFlag:
-      return <HiddenCell {...activeProps}>
-        <WeakFlag/>
-      </HiddenCell>
+    case CellState.weakFlag:
     default:
       return <OpenCell {...inactiveProps}>{type}</OpenCell>

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:121:5
       return <HiddenCell {...activeProps}>
         <WeakFlag/>
       </HiddenCell>
-    default:
-      return <OpenCell {...inactiveProps}>{type}</OpenCell>
+    default:
   }
 }
killedBy: Cell Component check prevent default for context menu
statusReason: Error: Unable to fire a "contextmenu" event - please provide a DOM element.
