[NoCoverage] ArrowFunction
src/components/Grid/Grid.tsx:14:28
 
 const GridContainer = styled.div<{size: number}>`
   display: grid;
-  grid-template-columns: ${({size}) => `repeat(${size}, 2rem)`};
+  grid-template-columns: ${() => undefined};
 `
 

[NoCoverage] BlockStatement
src/components/Grid/Grid.tsx:17:47
   grid-template-columns: ${({size}) => `repeat(${size}, 2rem)`};
 `
 
-const Grid = ({field, ...rest}: GridProps) => {
-  return <GridContainer size={field.length}>
-    {field.map((row, i) => {
-      return row.map((col, j) => {
-        return <Cell key={`${i}-${j}`} type={col} coords={[i, j]} {...rest}/>
-      })
-    })}
-  </GridContainer>
-}
+const Grid = ({field, ...rest}: GridProps) => {}
 
 export default Grid

[NoCoverage] BlockStatement
src/components/Grid/Grid.tsx:19:28
 
 const Grid = ({field, ...rest}: GridProps) => {
   return <GridContainer size={field.length}>
-    {field.map((row, i) => {
-      return row.map((col, j) => {
-        return <Cell key={`${i}-${j}`} type={col} coords={[i, j]} {...rest}/>
-      })
-    })}
+    {field.map((row, i) => {})}
   </GridContainer>
 }

[NoCoverage] BlockStatement
src/components/Grid/Grid.tsx:20:34
 const Grid = ({field, ...rest}: GridProps) => {
   return <GridContainer size={field.length}>
     {field.map((row, i) => {
-      return row.map((col, j) => {
-        return <Cell key={`${i}-${j}`} type={col} coords={[i, j]} {...rest}/>
-      })
+      return row.map((col, j) => {})
     })}
   </GridContainer>

[NoCoverage] ArrayDeclaration
src/components/Grid/Grid.tsx:21:59
   return <GridContainer size={field.length}>
     {field.map((row, i) => {
       return row.map((col, j) => {
-        return <Cell key={`${i}-${j}`} type={col} coords={[i, j]} {...rest}/>
+        return <Cell key={`${i}-${j}`} type={col} coords={[]} {...rest}/>
       })
     })}
