[NoCoverage] BlockStatement
src/components/Header/Header.tsx:10:59
 const StyledHeader = tw.header`text-center relative inline-block`
 
 export type HeaderProps = GameNameProps & LegendProps
-const Header = ({ text, ...legendProps }: HeaderProps) => {
-  return (
-    <StyledHeader>
-      <GameName text={text} />
-      <Legend {...legendProps} />
-    </StyledHeader>
-  )
-}
+const Header = ({ text, ...legendProps }: HeaderProps) => {}
 
 export default Header
