[NoCoverage] BlockStatement
src/components/Header/Legend.tsx:21:73
 
 const SecondAction = tw.span`text-sky-600`
 
-const Legend = ({ feature, firstAction, secondAction }: LegendProps) => {
-  return (
-    <Parent>
-      <strong>{feature}: </strong>
-      <FlagContainer>
-        <FirstAction>{firstAction}</FirstAction>{' '}
-        <span className="text-slate-800">+</span>{' '}
-        <SecondAction>{secondAction}</SecondAction>
-      </FlagContainer>
-    </Parent>
-  )
-}
+const Legend = ({ feature, firstAction, secondAction }: LegendProps) => {}
 
 export default Legend
