[NoCoverage] BlockStatement
src/components/Hud/Counter.tsx:11:46
 
 const CounterLabel = tw.p`inline-block border-2 border-rose-500 text-rose-600 bg-slate-700 p-1 tracking-tighter drop-shadow-counter`
 
-const Counter = ({ value }: CounterProps) => {
-  return (
-    <CounterLabel>
-      {value}
-    </CounterLabel>
-  )
-}
+const Counter = ({ value }: CounterProps) => {}
 
 export default Counter
