[NoCoverage] BlockStatement
src/components/Hud/Hud.tsx:15:60
 
 const HudContainer = tw.header`flex w-full pb-4 items-center justify-between`
 
-const Hud = ({ time, levels, mines, onReset}: HudProps) => {
-  return (
-    <HudContainer>
-      <Counter value={time}/>
-      <Level levels={levels}/>
-      <Reset onReset={onReset}/>
-      <Counter value={mines}/>
-    </HudContainer>
-  )
-}
+const Hud = ({ time, levels, mines, onReset}: HudProps) => {}
 
 export default Hud
