[NoCoverage] StringLiteral
src/components/Hud/Level.tsx:8:25
   levels: string[]
 }
 
-const Select = tw.select`m-0 p-2 text-slate-100 border border-slate-800 bg-slate-600`
+const Select = tw.select``
 const Option = tw.option`font-normal block whitespace-nowrap h-6 p-2`
 

[NoCoverage] BlockStatement
src/components/Hud/Level.tsx:11:43
 const Select = tw.select`m-0 p-2 text-slate-100 border border-slate-800 bg-slate-600`
 const Option = tw.option`font-normal block whitespace-nowrap h-6 p-2`
 
-const Level = ({ levels }: LevelProps) => {
-  return (
-    <Select>
-      {levels.map((o) => (
-        <Option key={new Date().getTime()} className="" value={o}>
-          {o}
-        </Option>
-      ))}
-    </Select>
-  )
-}
+const Level = ({ levels }: LevelProps) => {}
 
 export default Level

[NoCoverage] ArrowFunction
src/components/Hud/Level.tsx:14:19
 const Level = ({ levels }: LevelProps) => {
   return (
     <Select>
-      {levels.map((o) => (
-        <Option key={new Date().getTime()} className="" value={o}>
-          {o}
-        </Option>
-      ))}
+      {levels.map(() => undefined)}
     </Select>
   )
