[NoCoverage] EqualityOperator
courses/minesweeper/src/index.tsx:7:5
 import './index.css'
 
 const root = document.getElementById('root')
-if (root === null) throw new Error('root element not found')
+if (root !== null) throw new Error('root element not found')
 createRoot(root).render(<App />)
 

[NoCoverage] ConditionalExpression
courses/minesweeper/src/index.tsx:7:5
 import './index.css'
 
 const root = document.getElementById('root')
-if (root === null) throw new Error('root element not found')
+if (false) throw new Error('root element not found')
 createRoot(root).render(<App />)
 
