[Survived] StringLiteral
src/components/Hud/Reset.tsx:5:25
 import tw from 'twin.macro'
 import {useMouseDown} from '@/hooks/useMouseDown'
 
-const Button = tw.button`text-xl cursor-pointer border border-slate-800 bg-slate-600 p-1`
+const Button = tw.button``
 
 export interface ResetProps {

[Killed] BlockStatement
src/components/Hud/Reset.tsx:11:44
   onReset: () => void
 }
 
-const Reset = ({ onReset }: ResetProps) => {
-  const [mouseDown, onMouseUp, onMouseDown] = useMouseDown()
-
-  const handleReset = () => {
-    onMouseDown()
-    onReset()
-  }
-
-  return (
-    <Button onMouseDown={handleReset} onMouseUp={onMouseUp} onMouseLeave={onMouseUp}>
-      {mouseDown ? '😲' : '🙂'}
-    </Button>
-  )
-}
+const Reset = ({ onReset }: ResetProps) => {}
 
 export default Reset
killedBy: Reset Button should render elements with default state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/Hud/Reset.tsx:14:29
 const Reset = ({ onReset }: ResetProps) => {
   const [mouseDown, onMouseUp, onMouseDown] = useMouseDown()
 
-  const handleReset = () => {
-    onMouseDown()
-    onReset()
-  }
+  const handleReset = () => {}
 
   return (
killedBy: Reset Button should execute onReset when clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
