[Killed] BlockStatement
src/components/Header/GameName.tsx:12:47
   font-size: 2em;
 `
 
-const GameName = ({ text }: GameNameProps) => {
-  return <StyledH1>{text}</StyledH1>
-}
+const GameName = ({ text }: GameNameProps) => {}
 
 export default GameName
killedBy: GameName renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameName renders correctly 1`

- Snapshot  - 7
+ Received  + 1

- <DocumentFragment>
