[Killed] BlockStatement
minesweeper/src/helpers/field.ts:3:50
 import { Cell, CellState, Coordinates, Field, Neighbors } from '../types'
 
-export const isActive = (cell: Cell): boolean => {
-  return [CellState.hidden, CellState.mark, CellState.weakMark].includes(cell)
-}
+export const isActive = (cell: Cell): boolean => {}
 
 export const exists = ([row, col]: Coordinates, field: Field): boolean => {
killedBy: Cell Component onClick and onContextMenu handlers called for active cells
statusReason: Error: Error: `.each` called with an empty Array of table data.

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:7:75
   return [CellState.hidden, CellState.mark, CellState.weakMark].includes(cell)
 }
 
-export const exists = ([row, col]: Coordinates, field: Field): boolean => {
-
-  return field[row] !== undefined && field[row][col] !== undefined
-}
+export const exists = ([row, col]: Coordinates, field: Field): boolean => {}
 
 export const getNeighbors = ([row, col]: Coordinates): Neighbors => {
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:9:10
 
 export const exists = ([row, col]: Coordinates, field: Field): boolean => {
 
-  return field[row] !== undefined && field[row][col] !== undefined
+  return false
 }
 
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:9:10
 
 export const exists = ([row, col]: Coordinates, field: Field): boolean => {
 
-  return field[row] !== undefined && field[row][col] !== undefined
+  return true && field[row][col] !== undefined
 }
 
killedBy: MineField incrementNeighbors field with only one item
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:12:69
   return field[row] !== undefined && field[row][col] !== undefined
 }
 
-export const getNeighbors = ([row, col]: Coordinates): Neighbors => {
-  return {
-    top: [row - 1, col],
-    topRight: [row - 1, col + 1],
-    right: [row, col + 1],
-    rightBottom: [row + 1, col + 1],
-    bottom: [row + 1, col],
-    bottomLeft: [row + 1, col - 1],
-    left: [row, col - 1],
-    leftTop: [row - 1, col - 1],
-  }
-}
+export const getNeighbors = ([row, col]: Coordinates): Neighbors => {}
 
 export const MineSweeper = {
killedBy: MineField incrementNeighbors field with only one item
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] ObjectLiteral
minesweeper/src/helpers/field.ts:13:10
 }
 
 export const getNeighbors = ([row, col]: Coordinates): Neighbors => {
-  return {
-    top: [row - 1, col],
-    topRight: [row - 1, col + 1],
-    right: [row, col + 1],
-    rightBottom: [row + 1, col + 1],
-    bottom: [row + 1, col],
-    bottomLeft: [row + 1, col - 1],
-    left: [row, col - 1],
-    leftTop: [row - 1, col - 1],
-  }
+  return {}
 }
 
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:14:11
 
 export const getNeighbors = ([row, col]: Coordinates): Neighbors => {
   return {
-    top: [row - 1, col],
+    top: [row + 1, col],
     topRight: [row - 1, col + 1],
     right: [row, col + 1],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,9 +2,9 @@
    Array [
      9,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:15:25
 export const getNeighbors = ([row, col]: Coordinates): Neighbors => {
   return {
     top: [row - 1, col],
-    topRight: [row - 1, col + 1],
+    topRight: [row - 1, col - 1],
     right: [row, col + 1],
     rightBottom: [row + 1, col + 1],
killedBy: MineField getNeighbors with [0, 0] coordinates
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -27,8 +27,8 @@
      -1,
      0,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:15:16
 export const getNeighbors = ([row, col]: Coordinates): Neighbors => {
   return {
     top: [row - 1, col],
-    topRight: [row - 1, col + 1],
+    topRight: [row + 1, col + 1],
     right: [row, col + 1],
     rightBottom: [row + 1, col + 1],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
      9,
      1,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:16:18
   return {
     top: [row - 1, col],
     topRight: [row - 1, col + 1],
-    right: [row, col + 1],
+    right: [row, col - 1],
     rightBottom: [row + 1, col + 1],
     bottom: [row + 1, col],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Array [

[Killed] ArrayDeclaration
minesweeper/src/helpers/field.ts:16:12
   return {
     top: [row - 1, col],
     topRight: [row - 1, col + 1],
-    right: [row, col + 1],
+    right: [],
     rightBottom: [row + 1, col + 1],
     bottom: [row + 1, col],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Array [

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:17:19
     top: [row - 1, col],
     topRight: [row - 1, col + 1],
     right: [row, col + 1],
-    rightBottom: [row + 1, col + 1],
+    rightBottom: [row - 1, col + 1],
     bottom: [row + 1, col],
     bottomLeft: [row + 1, col - 1],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
      9,
      1,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:17:28
     top: [row - 1, col],
     topRight: [row - 1, col + 1],
     right: [row, col + 1],
-    rightBottom: [row + 1, col + 1],
+    rightBottom: [row + 1, col - 1],
     bottom: [row + 1, col],
     bottomLeft: [row + 1, col - 1],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
      9,
      1,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:18:14
     topRight: [row - 1, col + 1],
     right: [row, col + 1],
     rightBottom: [row + 1, col + 1],
-    bottom: [row + 1, col],
+    bottom: [row - 1, col],
     bottomLeft: [row + 1, col - 1],
     left: [row, col - 1],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,9 +2,9 @@
    Array [
      9,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:19:18
     right: [row, col + 1],
     rightBottom: [row + 1, col + 1],
     bottom: [row + 1, col],
-    bottomLeft: [row + 1, col - 1],
+    bottomLeft: [row - 1, col - 1],
     left: [row, col - 1],
     leftTop: [row - 1, col - 1],
killedBy: MineField getNeighbors with [0, 0] coordinates
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,11 +2,11 @@
    "bottom": Array [
      1,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:19:27
     right: [row, col + 1],
     rightBottom: [row + 1, col + 1],
     bottom: [row + 1, col],
-    bottomLeft: [row + 1, col - 1],
+    bottomLeft: [row + 1, col + 1],
     left: [row, col - 1],
     leftTop: [row - 1, col - 1],
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
      9,
      1,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:20:17
     rightBottom: [row + 1, col + 1],
     bottom: [row + 1, col],
     bottomLeft: [row + 1, col - 1],
-    left: [row, col - 1],
+    left: [row, col + 1],
     leftTop: [row - 1, col - 1],
   }
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Array [

[Killed] ArrayDeclaration
minesweeper/src/helpers/field.ts:20:11
     rightBottom: [row + 1, col + 1],
     bottom: [row + 1, col],
     bottomLeft: [row + 1, col - 1],
-    left: [row, col - 1],
+    left: [],
     leftTop: [row - 1, col - 1],
   }
killedBy: MineField getNeighbors with [0, 0] coordinates
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

@@ -5,14 +5,11 @@
    ],
    "bottomLeft": Array [

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:21:15
     bottom: [row + 1, col],
     bottomLeft: [row + 1, col - 1],
     left: [row, col - 1],
-    leftTop: [row - 1, col - 1],
+    leftTop: [row + 1, col - 1],
   }
 }
killedBy: MineField getNeighbors with [0, 0] coordinates
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -10,11 +10,11 @@
    "left": Array [
      0,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:21:24
     bottom: [row + 1, col],
     bottomLeft: [row + 1, col - 1],
     left: [row, col - 1],
-    leftTop: [row - 1, col - 1],
+    leftTop: [row - 1, col + 1],
   }
 }
killedBy: MineField getNeighbors with [0, 0] coordinates
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -11,11 +11,11 @@
      0,
      -1,

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:26:71
 }
 
 export const MineSweeper = {
-  buildEmpty: (size: number, state: Cell = CellState.empty): Field => {
-    return new Array(size).fill(null).map(() => new Array(size).fill(state))
-  },
+  buildEmpty: (size: number, state: Cell = CellState.empty): Field => {},
   buildField: (size: number, probability: number): Field => {
     if (probability < 0 || probability > 1)
killedBy: MineField Empty Field 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[0, 0], [0, 0]]
Received: undefined

[Killed] ArrowFunction
minesweeper/src/helpers/field.ts:27:43
 
 export const MineSweeper = {
   buildEmpty: (size: number, state: Cell = CellState.empty): Field => {
-    return new Array(size).fill(null).map(() => new Array(size).fill(state))
+    return new Array(size).fill(null).map(() => undefined)
   },
   buildField: (size: number, probability: number): Field => {
killedBy: MineField Empty Field 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:29:61
   buildEmpty: (size: number, state: Cell = CellState.empty): Field => {
     return new Array(size).fill(null).map(() => new Array(size).fill(state))
   },
-  buildField: (size: number, probability: number): Field => {
-    if (probability < 0 || probability > 1)
-      throw new Error('Density must be between 0 and 1')
-
-    let unprocessedCells = size * size
-    let restCellsWithBombs = unprocessedCells * probability
-    const mineField = MineSweeper.buildEmpty(size)
-
-    for (let i = 0; i < size; i++) {
-      for (let j = 0; j < size; j++) {
-        if (restCellsWithBombs === 0) return mineField
-        if (restCellsWithBombs / unprocessedCells > Math.random()) {
-          mineField[i][j] = CellState.bomb
-          MineSweeper.incrementNeighbors([i, j], mineField)
-          restCellsWithBombs--
-        }
-        unprocessedCells--
-      }
-    }
-    return mineField
-  },
+  buildField: (size: number, probability: number): Field => {},
   incrementNeighbors: (coords: Coordinates, field: Field): Field => {
     const neighbors = getNeighbors(coords)
killedBy: MineField Build Field should throw error when bad input for density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:30:28
     return new Array(size).fill(null).map(() => new Array(size).fill(state))
   },
   buildField: (size: number, probability: number): Field => {
-    if (probability < 0 || probability > 1)
+    if (probability < 0 || false)
       throw new Error('Density must be between 0 and 1')
 
killedBy: MineField Build Field should throw error when bad input for density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:30:9
     return new Array(size).fill(null).map(() => new Array(size).fill(state))
   },
   buildField: (size: number, probability: number): Field => {
-    if (probability < 0 || probability > 1)
+    if (true)
       throw new Error('Density must be between 0 and 1')
 
killedBy: MineField Build Field smallest possible field without mine
statusReason: Error: Density must be between 0 and 1

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:33:28
     if (probability < 0 || probability > 1)
       throw new Error('Density must be between 0 and 1')
 
-    let unprocessedCells = size * size
+    let unprocessedCells = size / size
     let restCellsWithBombs = unprocessedCells * probability
     const mineField = MineSweeper.buildEmpty(size)
killedBy: MineField Build Field 2x2 with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:34:30
       throw new Error('Density must be between 0 and 1')
 
     let unprocessedCells = size * size
-    let restCellsWithBombs = unprocessedCells * probability
+    let restCellsWithBombs = unprocessedCells / probability
     const mineField = MineSweeper.buildEmpty(size)
 
killedBy: MineField Build Field smallest possible field without mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     0,

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:37:36
     let restCellsWithBombs = unprocessedCells * probability
     const mineField = MineSweeper.buildEmpty(size)
 
-    for (let i = 0; i < size; i++) {
-      for (let j = 0; j < size; j++) {
-        if (restCellsWithBombs === 0) return mineField
-        if (restCellsWithBombs / unprocessedCells > Math.random()) {
-          mineField[i][j] = CellState.bomb
-          MineSweeper.incrementNeighbors([i, j], mineField)
-          restCellsWithBombs--
-        }
-        unprocessedCells--
-      }
-    }
+    for (let i = 0; i < size; i++) {}
     return mineField
   },
killedBy: MineField Build Field smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:38:38
     const mineField = MineSweeper.buildEmpty(size)
 
     for (let i = 0; i < size; i++) {
-      for (let j = 0; j < size; j++) {
-        if (restCellsWithBombs === 0) return mineField
-        if (restCellsWithBombs / unprocessedCells > Math.random()) {
-          mineField[i][j] = CellState.bomb
-          MineSweeper.incrementNeighbors([i, j], mineField)
-          restCellsWithBombs--
-        }
-        unprocessedCells--
-      }
+      for (let j = 0; j < size; j++) {}
     }
     return mineField
killedBy: MineField Build Field smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:39:13
 
     for (let i = 0; i < size; i++) {
       for (let j = 0; j < size; j++) {
-        if (restCellsWithBombs === 0) return mineField
+        if (true) return mineField
         if (restCellsWithBombs / unprocessedCells > Math.random()) {
           mineField[i][j] = CellState.bomb
killedBy: MineField Build Field smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] EqualityOperator
minesweeper/src/helpers/field.ts:39:13
 
     for (let i = 0; i < size; i++) {
       for (let j = 0; j < size; j++) {
-        if (restCellsWithBombs === 0) return mineField
+        if (restCellsWithBombs !== 0) return mineField
         if (restCellsWithBombs / unprocessedCells > Math.random()) {
           mineField[i][j] = CellState.bomb
killedBy: MineField Build Field smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:40:13
     for (let i = 0; i < size; i++) {
       for (let j = 0; j < size; j++) {
         if (restCellsWithBombs === 0) return mineField
-        if (restCellsWithBombs / unprocessedCells > Math.random()) {
+        if (false) {
           mineField[i][j] = CellState.bomb
           MineSweeper.incrementNeighbors([i, j], mineField)
killedBy: MineField Build Field smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:40:68
     for (let i = 0; i < size; i++) {
       for (let j = 0; j < size; j++) {
         if (restCellsWithBombs === 0) return mineField
-        if (restCellsWithBombs / unprocessedCells > Math.random()) {
-          mineField[i][j] = CellState.bomb
-          MineSweeper.incrementNeighbors([i, j], mineField)
-          restCellsWithBombs--
-        }
+        if (restCellsWithBombs / unprocessedCells > Math.random()) {}
         unprocessedCells--
       }
killedBy: MineField Build Field smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ArrayDeclaration
minesweeper/src/helpers/field.ts:42:42
         if (restCellsWithBombs === 0) return mineField
         if (restCellsWithBombs / unprocessedCells > Math.random()) {
           mineField[i][j] = CellState.bomb
-          MineSweeper.incrementNeighbors([i, j], mineField)
+          MineSweeper.incrementNeighbors([], mineField)
           restCellsWithBombs--
         }
killedBy: MineField Build Field 2x2 with 50% probability
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   2,
-   2,

[Killed] UpdateOperator
minesweeper/src/helpers/field.ts:43:11
         if (restCellsWithBombs / unprocessedCells > Math.random()) {
           mineField[i][j] = CellState.bomb
           MineSweeper.incrementNeighbors([i, j], mineField)
-          restCellsWithBombs--
+          restCellsWithBombs++
         }
         unprocessedCells--
killedBy: MineField Build Field 2x2 with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 4
Received array:  [9, 9, 9, 9]

[Killed] UpdateOperator
minesweeper/src/helpers/field.ts:45:9
           MineSweeper.incrementNeighbors([i, j], mineField)
           restCellsWithBombs--
         }
-        unprocessedCells--
+        unprocessedCells++
       }
     }
killedBy: MineField Build Field 2x2 with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Array [
      9,

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:50:69
     }
     return mineField
   },
-  incrementNeighbors: (coords: Coordinates, field: Field): Field => {
-    const neighbors = getNeighbors(coords)
-    Object.values(neighbors).forEach((coords) => {
-      const [row, col] = coords
-      if (exists(coords, field)) {
-        const cell: Cell = field[row][col]
-        if (cell < CellState.bomb - 1) {
-          field[row][col] += 1
-        }
-      }
-    })
-    return field
-  },
+  incrementNeighbors: (coords: Coordinates, field: Field): Field => {},
 }
 
killedBy: MineField incrementNeighbors field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined

[Killed] BlockStatement
minesweeper/src/helpers/field.ts:52:50
   },
   incrementNeighbors: (coords: Coordinates, field: Field): Field => {
     const neighbors = getNeighbors(coords)
-    Object.values(neighbors).forEach((coords) => {
-      const [row, col] = coords
-      if (exists(coords, field)) {
-        const cell: Cell = field[row][col]
-        if (cell < CellState.bomb - 1) {
-          field[row][col] += 1
-        }
-      }
-    })
+    Object.values(neighbors).forEach((coords) => {})
     return field
   },
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:54:11
     const neighbors = getNeighbors(coords)
     Object.values(neighbors).forEach((coords) => {
       const [row, col] = coords
-      if (exists(coords, field)) {
+      if (true) {
         const cell: Cell = field[row][col]
         if (cell < CellState.bomb - 1) {
killedBy: MineField incrementNeighbors field with only one item
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:54:11
     const neighbors = getNeighbors(coords)
     Object.values(neighbors).forEach((coords) => {
       const [row, col] = coords
-      if (exists(coords, field)) {
+      if (false) {
         const cell: Cell = field[row][col]
         if (cell < CellState.bomb - 1) {
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
minesweeper/src/helpers/field.ts:56:13
       const [row, col] = coords
       if (exists(coords, field)) {
         const cell: Cell = field[row][col]
-        if (cell < CellState.bomb - 1) {
+        if (true) {
           field[row][col] += 1
         }
killedBy: MineField incrementNeighbors field 2x2 with two mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
      9,
      1,

[Killed] ArithmeticOperator
minesweeper/src/helpers/field.ts:56:20
       const [row, col] = coords
       if (exists(coords, field)) {
         const cell: Cell = field[row][col]
-        if (cell < CellState.bomb - 1) {
+        if (cell < CellState.bomb + 1) {
           field[row][col] += 1
         }
killedBy: MineField incrementNeighbors field 2x2 with two mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
      9,
      1,

[Killed] AssignmentOperator
minesweeper/src/helpers/field.ts:57:11
       if (exists(coords, field)) {
         const cell: Cell = field[row][col]
         if (cell < CellState.bomb - 1) {
-          field[row][col] += 1
+          field[row][col] -= 1
         }
       }
killedBy: MineField incrementNeighbors field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,
