[Killed] BlockStatement
minesweeper/src/hooks/useMouseDown.ts:6:84
 type OnMouseDownHandler = () => void
 type OnMouseUpHandler = () => void
 
-export const useMouseDown = (): [boolean, OnMouseUpHandler, OnMouseDownHandler] => {
-  const [mouseDown, setMouseDown] = useState(false)
-
-  const onMouseUp = () => setMouseDown(false)
-  const onMouseDown = () => setMouseDown(true)
-  return [mouseDown, onMouseUp, onMouseDown]
-}
+export const useMouseDown = (): [boolean, OnMouseUpHandler, OnMouseDownHandler] => {}
killedBy: Reset Button should render elements with default state
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
minesweeper/src/hooks/useMouseDown.ts:7:46
 type OnMouseUpHandler = () => void
 
 export const useMouseDown = (): [boolean, OnMouseUpHandler, OnMouseDownHandler] => {
-  const [mouseDown, setMouseDown] = useState(false)
+  const [mouseDown, setMouseDown] = useState(true)
 
   const onMouseUp = () => setMouseDown(false)
killedBy: Reset Button should render elements with default state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-n2cwly"
    >

[Killed] ArrowFunction
minesweeper/src/hooks/useMouseDown.ts:9:21
 export const useMouseDown = (): [boolean, OnMouseUpHandler, OnMouseDownHandler] => {
   const [mouseDown, setMouseDown] = useState(false)
 
-  const onMouseUp = () => setMouseDown(false)
+  const onMouseUp = () => undefined
   const onMouseDown = () => setMouseDown(true)
   return [mouseDown, onMouseUp, onMouseDown]
killedBy: Reset Button should update button text on mouseDown
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-n2cwly"
    >

[Killed] BooleanLiteral
minesweeper/src/hooks/useMouseDown.ts:9:40
 export const useMouseDown = (): [boolean, OnMouseUpHandler, OnMouseDownHandler] => {
   const [mouseDown, setMouseDown] = useState(false)
 
-  const onMouseUp = () => setMouseDown(false)
+  const onMouseUp = () => setMouseDown(true)
   const onMouseDown = () => setMouseDown(true)
   return [mouseDown, onMouseUp, onMouseDown]
killedBy: Reset Button should update button text on mouseDown
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-n2cwly"
    >

[Killed] ArrowFunction
minesweeper/src/hooks/useMouseDown.ts:10:23
   const [mouseDown, setMouseDown] = useState(false)
 
   const onMouseUp = () => setMouseDown(false)
-  const onMouseDown = () => setMouseDown(true)
+  const onMouseDown = () => undefined
   return [mouseDown, onMouseUp, onMouseDown]
 }
killedBy: Reset Button should update button text on mouseDown
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😲. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-n2cwly"
    >

[Killed] BooleanLiteral
minesweeper/src/hooks/useMouseDown.ts:10:42
   const [mouseDown, setMouseDown] = useState(false)
 
   const onMouseUp = () => setMouseDown(false)
-  const onMouseDown = () => setMouseDown(true)
+  const onMouseDown = () => setMouseDown(false)
   return [mouseDown, onMouseUp, onMouseDown]
 }
killedBy: Reset Button should update button text on mouseDown
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😲. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-n2cwly"
    >

[Killed] ArrayDeclaration
minesweeper/src/hooks/useMouseDown.ts:11:10
 
   const onMouseUp = () => setMouseDown(false)
   const onMouseDown = () => setMouseDown(true)
-  return [mouseDown, onMouseUp, onMouseDown]
+  return []
 }
killedBy: Reset Button should execute onReset when clicked
statusReason: TypeError: onMouseDown is not a function
